package lesson27;

public class Quiz {
    /*

     С помощью какого механизма можно избежать дублирования кода в двех разных классах?
     - Наследование

     С помощью какого ключевого слова мы наследываемся?
     - extends

     А extends B - где предок, где потомок?
     В - предок
     А - потомок

     С помощью какого модификатора можно сделать так,чтобы метод или поле было в потомке?
     - protected
     - public

     Какие элементы класса - предка(родителя) копируются в классы- потомки?
     - поля
     - методы
     - НЕ копируются конструкторы

     Как принудительно вызвать конструктора-предка в конструкторе-потомке?
     - super()

     Что будет,если в конструкторе потомке не вызывать явно конструктор предка?
     - Java попытается вызыать пустой конструктор предка (super())
     - А если такого конструктора нет,то будет ошибка компиляции

     */
}
