package lesson28.hw28.vehicle;

//Создайте иерархию классов для разных типов транспортных средств: Vehicle (родительский класс), Car, Bicycle и Motorcycle (дочерние классы).
//Родительский класс Vehicle должен иметь метод startEngine(), который не будет иметь реализации.
//Дочерние классы Car, Bicycle и Motorcycle должны переопределить метод startEngine() для запуска соответствующего типа двигателя (если есть).
//Создайте массив транспортных средств разных типов.
// Используйте полиморфизм для вызова метода startEngine() для каждого транспортного средства.

public class Vehicle {

    public void startEngine(){
        System.out.println("Запуск двигателя транспортного средства...");
    }



}
